ANTONYMS = [
    ({'очн', 'очное'}, {'дистанционн', 'удаленн'}),
    ({'входящ'}, {'исходящ'}),
    ({'frontend', 'фронтенд', 'front-end'}, {'backend', 'бэкенд', 'бекенд', 'back-end'}),

    ({'директор', 'chief', 'cdo', 'cmo', 'cto'}, {'менеджер', 'manager', 'специалист', 'ассистент'}),
    ({'помощник', 'ассистент'}, {'руководител', 'начальник', 'директор'}),

    ({'ветеринар'}, {'врач', 'терапевт', 'хирург'}),
    ({'весовщик'}, {'кабельщик', 'монтажник', 'слесарь'}),

    ({'spring'}, {'primavera'}),
    ({'бекенд', 'backend'}, {'форсайт'}),
    
    ({'печатн', 'наружн'}, {'баннерн', 'таргетирован', 'digital', 'цифров'}),
    
    ({'очн', 'группов'}, {'индивидуальн', 'дистанционн', 'удаленн'}),
    
    ({'бгу'}, {'усн', 'тоир', 'erp', 'упп', 'до', 'зуп'}),

    ({'логик', 'логика'}, {'логистик', 'логистика'}),
    ({'иб'}, {'ибп'}),
    ({'sca'}, {'scad'})
]

CRITICAL_MODIFIERS = [
    'senior', 'сеньор', 'старший',
    'middle', 'мидл', 'средний',
    'junior', 'джун', 'младший',
    'lead', 'ведущий', 
    'стажер', 'intern',
    'станков', 'чпу',
    'баз данных', 'database',
    'информационной безопасности', 'security',
    'data science'
]
